CREATE DATABASE  IF NOT EXISTS `pb` /*!40100 DEFAULT CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci */ /*!80016 DEFAULT ENCRYPTION='N' */;
USE `pb`;
-- MySQL dump 10.13  Distrib 8.0.27, for Win64 (x86_64)
--
-- Host: localhost    Database: pb
-- ------------------------------------------------------
-- Server version	8.0.27

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `product`
--

DROP TABLE IF EXISTS `product`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `product` (
  `id` int NOT NULL,
  `title` varchar(45) NOT NULL,
  `upload_time` datetime NOT NULL,
  `update_time` datetime DEFAULT NULL,
  `average_rate` float NOT NULL DEFAULT '0',
  `body_part_id` int NOT NULL,
  `sold` int NOT NULL,
  `remain` int NOT NULL,
  `price` int NOT NULL,
  `intro` varchar(1000) NOT NULL,
  `detail` varchar(1000) NOT NULL,
  `product_type_id` int NOT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `product`
--

LOCK TABLES `product` WRITE;
/*!40000 ALTER TABLE `product` DISABLE KEYS */;
INSERT INTO `product` VALUES (1,'6公斤壺鈴','2021-11-21 16:05:30','2021-11-21 16:05:30',3.25,4,260,95,699,'結合肌力強化及有氧訓練！壺鈴訓練不僅能夠幫助增加肌肉力量，更能幫助提升肌肉延展性及耐力。',' 性別 : 中性\n運動 : 健身\n運動範圍 : 肌肉強化： 強健肌肉 重量訓練\n材質 : 框架 : 100.0% 鐵 外蓋 : 100.0% 橡膠 - 順丁橡膠（BR ） ',3),(2,'8公斤壺鈴','2021-11-21 16:40:03','2021-11-21 16:40:03',5,3,50,313,986,'8kg壺鈴','8kg',3),(3,'10kg啞鈴','2021-11-21 16:40:03','2021-11-21 16:40:03',3,4,28,28,788,'10kg啞鈴','10kg重',3),(4,'10公斤六角啞鈴(單入)','2021-11-21 21:35:03','2021-11-21 21:35:03',2,5,120,98,959,'10公斤六角啞鈴(單入)','10公斤',3),(5,'20kg啞鈴','2021-11-21 21:35:03','2021-11-21 21:35:03',5,6,89,31,250,'20kg啞鈴','20kg',3),(6,'BCAA支鏈胺基酸','2021-11-21 21:35:03','2021-11-21 21:35:03',3,1,31,119,500,'BCAA支鏈胺基酸','健康營養的bcaa',1),(7,'肌酸500g','2021-11-21 21:35:03','2021-11-21 21:35:03',1.2,1,4,100,300,'creatine的拉','creatine',1),(8,'魚油','2021-11-21 21:35:03','2021-11-21 21:35:03',4,1,128,90,959,'魚油','200顆',1),(9,'一氧化氮','2021-11-21 21:35:03','2021-11-21 21:35:03',3,1,80,40,250,'一氧化氮','300g',1),(10,'綜合維他命','2021-11-21 21:35:03','2021-11-21 21:35:03',3,1,29,121,500,'綜合維他命','150顆',1),(11,'Pre-Workout 預鍛鍊','2021-11-21 21:35:03','2021-11-21 21:35:03',0,1,12,1000,300,'Pre-Workout 預鍛鍊','Pre-350g',1),(19,'禮物卡','2021-11-22 12:18:16','2021-11-22 12:18:16',5,1,50,999,499,'禮物卡','一組序號',2),(20,'WheyProtein乳清蛋白','2021-11-24 14:34:53','2021-11-24 14:34:53',4.2,1,100,120,1998,'WheyProtein乳清蛋白','WheyProtein乳清蛋白:2000g',1),(21,'丙胺酸','2021-11-24 14:34:53','2021-11-24 14:34:53',4,1,10,10,600,'丙胺酸','500g',1),(22,'瓜氨酸','2021-11-24 14:34:53','2021-11-24 14:34:53',3.1,1,52,53,199,'瓜氨酸','瓜氨酸',1),(23,'伏地挺身架','2021-11-24 14:34:53','2021-11-24 14:34:53',4.2,2,50,4,333,'伏地挺身架','伏地挺身架~!',3),(24,'懸吊式訓練器','2021-12-03 22:53:28','2021-12-03 22:53:28',5,5,104,146,599,'這款DST懸掛式訓練器能讓你透過重訓及功能性的運動來鍛鍊肌群：手臂、雙腿、背部、核心等。 根據自己的健身程度及目標，你可以用訓練器來支撐身體重量及提升不穩定性，藉此降低或增加運動時的困難度。可在室內或戶外使用，並放在包包隨身攜帶。\r\n懸吊式訓練器原本是傘兵在軍營訓練時使用。之後，許多人用訓練器來進行功能性重訓及肌肉強化訓練運動。 為了知道DST的實際使用表現，我們也在警察局及消防局對產品進行測試！','運動 : 健身\r\n運動範圍 : 肌肉強化： 強健肌肉 重量訓練\r\n材質 : 扁帶 : 100.0% 聚丙烯纖維 手把 : 75.0% 聚對苯二甲酸乙二酯（PET）, 手把 : 25.0% 橡膠 - 熱塑性橡膠（ TPR ） 扣環 : 100.0% 鋅合金\r\n\r\n',0),(25,'能量棒','2021-12-03 23:59:31','2021-12-03 23:59:31',4.2,1,101,249,200,'能量棒','很多大卡',1),(26,'健腹椅','2021-12-04 00:01:09','2021-12-04 00:01:09',3.4,1,25,100,1250,'','',3),(27,'握力器','2021-12-04 00:02:42','2021-12-04 00:02:42',2.5,2,54,45,499,'','',3),(28,'健身訓練板','2021-12-04 00:13:46','2021-12-04 00:13:46',3.5,3,50,50,649,'多用途\r\n不同位置可訓練胸部、肩部、手臂及背部肌肉。\r\n耐用度\r\n握把能依需求進行調整，最大可承重130 kg。\r\n耐用度\r\n握把能依需求進行調整，最大可承重130 kg。\r\n','\r\n性別 : 中性\r\n運動 : 健身\r\n運動範圍 : 肌肉強化： 強健肌肉 重量訓練\r\n材質 : 板 : 100.0% ABS樹脂 手把 : 100.0% ABS樹脂 基座 : 100.0% 熱塑性彈性體（TPE）\r\n',3),(29,'圓形握力器','2021-12-04 00:19:21','2021-12-04 00:19:21',3.8,2,100,500,299,'這款配件是隨時鍛鍊時前臂不可或缺的產品。可攜帶至各處並方便收納：放入包包、抽屜、口袋都可以。',' 性別 : 中性\r\n運動 : 健身\r\n運動範圍 : 肌肉強化： 強健肌肉 重量訓練\r\n材質 : 結構 : 100.0% 熱塑性彈性體（TPE） ',3),(30,'可鎖式引體向上單桿 (70-95cm)','2021-12-04 00:24:45','2021-12-04 00:24:45',2.4,5,10,250,899,'想要一款可以立刻裝上的拉桿？試試我們的引體向上拉桿：不用螺絲就能安裝，讓你隨時鍛鍊上半身。',' 性別 : 中性\r\n運動 : 健身\r\n運動範圍 : 肌肉強化： 強健肌肉 重量訓練\r\n材質 : 框架 : 80.0% 鋼, 框架 : 15.0% 橡膠 - 丁腈橡膠（ NBR）, 框架 : 5.0% 熱塑性聚氨酯 ',3),(31,'輕量速度跳繩 (3.35m)','2021-12-04 00:31:02','2021-12-04 00:31:02',3.4,6,50,200,599,'這款跳繩非常適合在交叉訓練時進行二迴旋。專為老手設計。',' 性別 : 中性\r\n運動 : 健身\r\n運動範圍 : 肌肉強化： 強健肌肉 重量訓練\r\n材質 : 手把 : 80.0% 鋁, 手把 : 15.0% ABS樹脂, 手把 : 5.0% 聚縮醛（POM） 繩索 : 50.0% 鋼, 繩索 : 50.0% 聚醯纖維 6 保護套 : 100.0% 聚氨酯纖維 （PU） 旅行袋 : 80.0% 聚酯纖維, 旅行袋 : 20.0% 聚醯胺纖維 螺絲 : 100.',3),(32,'健身划船機 (免組裝)','2021-12-04 00:34:46','2021-12-04 00:34:46',4,5,14,200,3999,'隨時隨地都可使用！ 迪卡儂創新的划船機100！划船機的設計讓你輕鬆燃燒最多的卡路里，且不占空間！',' 性別 : 中性\r\n運動 : 健身\r\n運動範圍 : 心肺訓練\r\n材質 : 框架 : 100.0% 鋼 輪子 : 100.0% 聚醯纖維 槓片鎖 : 100.0% 聚縮醛（POM） 保護套 : 100.0% ABS樹脂 繩索 : 100.0% 橡膠 - 二烯類彈性纖維（ED） 內層布料 : 100.0% PVC塑膠（聚氯乙烯）\r\n',3);
/*!40000 ALTER TABLE `product` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-02-22 13:52:59
